print("\n*************************************ex1*************************************")
# 리스트(list)? : 값을 나열해서 저장하는 것
# 원소 : 리스트에 저장 된 각각의 값들
# 인덱스(index, 색인) : 위치 값
# 여기서 주의할 점은 리스트의 인덱스는 항상 0부터 시작한다는 점입니다. 즉, 리스트 a의 첫 번째 요소는 a[0]
a = [1, 2, 3, 4, 5, 6, 7, 8]
b = 1
# a의 자료형은 list
print("type(a): ", type(a))
print("type(b): ", type(b))

# a 리스트 전체 출력
print("a: ", a)

# a의 0번째 인덱스의 요소(값)는 1
print("a[0]: ", a[0])

print("a[4]:", a[4])

# len은 a라는 리스트의 길이를 알려주는 내장 함수
print("len(a): ", len(a))

# a[-1] 처럼 인덱스가 -1인 경우는 리스트의 마지막 요소가 출력
print("a[-1]:", a[-1])

print("a[0]+a[1] =", a[0] + a[1])

print("\n*************************************ex2*************************************")
a = ["안녕", "하세요", "저는", "홍길동", "입니다"]
print("a: ", a)
print("type(a): ", type(a))
print("a[0]: ", a[0])
print("a[4]:", a[4])
print("len(a): ", len(a))
print("a[-1]:", a[-1])
print("a[0]+a[1] =", a[0] + a[1])
