# for 문이란 ? 반복문이다.

print("\n*************************************ex1*************************************")
# 0~9까지 출력하는 프로그램을 작성하라.
# range : 범위 설정! 여기서는 10번 for문을 돌아라는 뜻
for i in range(10):
    print(i)

# 2~9까지 출력하는 프로그램을 작성하라.
print("\n*************************************ex2*************************************")
for i in range(2, 10):
    print(i)

print("\n*************************************ex3*************************************")
# 2중 for 문
for first in range(2):
    print("first: ", first)
    for second in range(3):
        print("second:", second)

print("\n*************************************ex4*************************************")
# 아래 리스트 a에 담긴 모든 원소(요소,element)를 출력하는 프로그램을 만드시오.
a = [1, 2, 3, 4, 5]
print(a[0])
print(a[1])
print(a[2])
print(a[3])
print(a[4])

print("\n*************************************ex5*************************************")
# 위 프로그램을 for문으로 수정하여 같은 결과를 출력하는 프로그램을 만드시오.
for i in range(len(a)):
    print(a[i])

print("\n*************************************ex6*************************************")
# 위 프로그램을 더욱 간략하게 수정
for i in a:
    print(i)

print("\n*************************************ex7*************************************")
a = ["안녕", "하세요", "저는", "홍길동", "입니다"]
for i in a:
    print(i)
